<?php
/**
 * 游戏相关配置文件
 * @author dk <wangchangchun@nenxun.com>
 */

return array(

    "LOOTTYPES" => array(
            1 => "铜钱",
            2 => " 元宝",
            3 => " 卡牌",
            4 => " 装备",
            5 => " 卡牌碎片",
            6 => " 装备碎片",
            7 => " 掉落组",
            8 => " 君主经验值",
            9 => " 道具",
            21 => "声望"
        ),

    "EXPORT_EXCEL_HEADER1"   => array(
            "掉落ID
11&15为粮食卡掉落组
12&16为装备掉落组
13&17为宝箱钥匙掉落组
14&18为探索令牌
21为卡牌碎片掉落组
22为精英同类型",
        "掉落种类
1表示从后面掉落中按照概率抽取一个
0表示掉落组全都掉落
n表示等概率放回抽取掉落的道具种类。",
        "掉落详尽",
        null,null,null,
        "内容ID
填写物品类型对应的ID",
        "内容等级
内容为卡牌与装备时，在此字段填入等级，其余种类填0",
        "奖励物品1 类型ID
1 铜钱
2 元宝
3 卡牌
4 装备
5 卡牌碎片
6 装备碎片
7 掉落组
8 君主经验值
9 道具
21声望",
        "最小值",
        "最大值",
        "是否独立概率：1，是；0否",
        "概率",
     )
);
